Documents/упИзменениеСостоянияТранспортногоСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упИзменениеСостоянияТранспортногоСредства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСостоянияТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упЗанятостьТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗанятостьТранспорта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаОкончания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаНачала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактОкончания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаРемонтИТОТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упИзменениеСостоянияТранспортногоСредства</v8:Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упТипыСостоянийТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыСостоянийТС</Name>
			<Comment>Порядок значений связан с порядком элементов в коллекции картинок упКоллекцияТипыСостоянийТС</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРейсе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недоступно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упИзменениеСостоянияТранспортногоСредства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура формирует движения по регистру "упЗанятостьТранспорта".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//  Движения - КоллекцияДвижений - Коллекция движений документа.
//  РеквизитыОбъекта - Структура - Реквизиты объекта.
//  Отказ - Булево - флаг ошибки.
//
Процедура СформироватьДвиженияЗанятостьТранспорта(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ) Экспорт
	
	Если Ложь Тогда // Для контекстной подсказки.
	    Ссылка = Документы.упИзменениеСостоянияТранспортногоСредства.ПустаяСсылка();
	    РеквизитыОбъекта = Ссылка;
		Движения = Ссылка.ПолучитьОбъект().Движения;
		ДополнительныеСвойства = Ссылка.ПолучитьОбъект().ДополнительныеСвойства;
	КонецЕсли;
	
	ВыполнитьОтказДляТС = Ложь;
	Если НЕ Ссылка.ТранспортноеСредство.СобственноеТранспортноеСредство Тогда
		ВыполнитьОтказДляТС = НЕ ПолучитьФункциональнуюОпцию("упИспользуетсяУчетЗанятостиЭкипажейСтороннихПеревозчиков");
	КонецЕсли;
	
	Если Отказ ИЛИ ВыполнитьОтказДляТС Тогда 
		Возврат; 
	КонецЕсли;
	СрезПоследних = упУчетТранспортныхСредств.СрезПоследнихЗанятостьТранспорта(Ссылка.МоментВремени(), Документы.упИзменениеСостоянияТранспортногоСредства.ПустаяСсылка());
	Если Ложь Тогда // Для контекстной подсказки.
	    СрезПоследних = Новый  ТаблицаЗначений;
	КонецЕсли;
	ЗанятостьТранспорта = Движения.упЗанятостьТранспорта;
	ЗанятостьТранспорта.Записывать = Истина;
	Если Ложь
		Или Ссылка.Состояние.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Недоступно
		Или Ссылка.Состояние.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.ВРейсе
		Или Ссылка.Состояние.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Ремонт
	Тогда
		Если СрезПоследних.Количество() = 0 Тогда
			ДвиженияСостояние = ЗанятостьТранспорта.Добавить();
			ДвиженияСостояние.Период = Ссылка.Дата;
			ДвиженияСостояние.Документ = Документы.упИзменениеСостоянияТранспортногоСредства.ПустаяСсылка();
			ДвиженияСостояние.Транспорт = Ссылка.ТранспортноеСредство;
			ДвиженияСостояние.ПланАктуален = Истина;
			ДвиженияСостояние.ДатаНачала = Ссылка.ДатаИзмененияСостояния;
			ДвиженияСостояние.ДатаОкончания = Ссылка.ПлановоеОкончание;
			ДвиженияСостояние.ЗонаНачала = Ссылка.Адрес.ГеографическаяЗона;
			ДвиженияСостояние.ЗонаОкончания = ДвиженияСостояние.ЗонаНачала;
			ДвиженияСостояние.СостояниеТранспорта = Ссылка.Состояние;
		КонецЕсли; 
	ИначеЕсли Ложь
		Или Ссылка.Состояние.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Свободно
	Тогда
		Если СрезПоследних.Количество() > 0 Тогда
			ДвиженияСостояние = ЗанятостьТранспорта.Добавить();
			ЗаполнитьЗначенияСвойств(ДвиженияСостояние, Ссылка); 
			ДвиженияСостояние.Период = Ссылка.Дата;
			ДвиженияСостояние.ПланАктуален = Ложь;
			ДвиженияСостояние.ФактНачала = Истина;
			ДвиженияСостояние.ФактОкончания = Истина;
			ДвиженияСостояние.ДатаОкончания = Ссылка.Дата;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Адрес");
	БлокируемыеРеквизиты.Добавить("ДатаИзмененияСостояния");
	БлокируемыеРеквизиты.Добавить("ТранспортноеСредство");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  // Нет.
   	
КонецПроцедуры // ДобавитьКомандыПечати()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати - СписокЗначений - объекты печати: 
//											  * значение - ссылка на объект.
//                                            * представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Нет.
	
КонецПроцедуры // Печать()

#КонецОбласти

#КонецЕсли
